FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/drivers/fsl_usart.h
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef _FSL_USART_H_
    #define _FSL_USART_H_

    #include "fsl_common.h"

/*!
 * @addtogroup usart_driver
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief USART driver version. */
    #define FSL_USART_DRIVER_VERSION    ( MAKE_VERSION( 2, 5, 1 ) )
/*@}*/

    #define USART_FIFOTRIG_TXLVL_GET( base )    ( ( ( base )->FIFOTRIG & USART_FIFOTRIG_TXLVL_MASK ) >> USART_FIFOTRIG_TXLVL_SHIFT )
    #define USART_FIFOTRIG_RXLVL_GET( base )    ( ( ( base )->FIFOTRIG & USART_FIFOTRIG_RXLVL_MASK ) >> USART_FIFOTRIG_RXLVL_SHIFT )

/*! @brief Retry times for waiting flag. */
    #ifndef UART_RETRY_TIMES
        #define UART_RETRY_TIMES    0U/* Defining to zero means to keep waiting for the flag until it is assert/deassert. */
    #endif

/*! @brief Error codes for the USART driver. */
    enum
    {
        kStatus_USART_TxBusy = MAKE_STATUS( kStatusGroup_LPC_USART, 0 ),              /*!< Transmitter is busy. */
        kStatus_USART_RxBusy = MAKE_STATUS( kStatusGroup_LPC_USART, 1 ),              /*!< Receiver is busy. */
        kStatus_USART_TxIdle = MAKE_STATUS( kStatusGroup_LPC_USART, 2 ),              /*!< USART transmitter is idle. */
        kStatus_USART_RxIdle = MAKE_STATUS( kStatusGroup_LPC_USART, 3 ),              /*!< USART receiver is idle. */
        kStatus_USART_TxError = MAKE_STATUS( kStatusGroup_LPC_USART, 7 ),             /*!< Error happens on txFIFO. */
        kStatus_USART_RxError = MAKE_STATUS( kStatusGroup_LPC_USART, 9 ),             /*!< Error happens on rxFIFO. */
        kStatus_USART_RxRingBufferOverrun = MAKE_STATUS( kStatusGroup_LPC_USART, 8 ), /*!< Error happens on rx ring buffer */
        kStatus_USART_NoiseError = MAKE_STATUS( kStatusGroup_LPC_USART, 10 ),         /*!< USART noise error. */
        kStatus_USART_FramingError = MAKE_STATUS( kStatusGroup_LPC_USART, 11 ),       /*!< USART framing error. */
        kStatus_USART_ParityError = MAKE_STATUS( kStatusGroup_LPC_USART, 12 ),        /*!< USART parity error. */
        kStatus_USART_BaudrateNotSupport =
            MAKE_STATUS( kStatusGroup_LPC_USART, 13 ),                                /*!< Baudrate is not support in current clock source */
        kStatus_USART_Timeout = MAKE_STATUS( kStatusGroup_LPC_USART, 14 ),            /*!< USART time out. */
    };

/*! @brief USART synchronous mode. */
    typedef enum _usart_sync_mode
    {
        kUSART_SyncModeDisabled = 0x0U, /*!< Asynchronous mode.       */
        kUSART_SyncModeSlave = 0x2U,    /*!< Synchronous slave mode.  */
        kUSART_SyncModeMaster = 0x3U,   /*!< Synchronous master mode. */
    } usart_sync_mode_t;

/*! @brief USART parity mode. */
    typedef enum _usart_parity_mode
    {
        kUSART_ParityDisabled = 0x0U, /*!< Parity disabled */
        kUSART_ParityEven = 0x2U,     /*!< Parity enabled, type even, bit setting: PE|PT = 10 */
        kUSART_ParityOdd = 0x3U,      /*!< Parity enabled, type odd,  bit setting: PE|PT = 11 */
    } usart_parity_mode_t;

/*! @brief USART stop bit count. */
    typedef enum _usart_stop_bit_count
    {
        kUSART_OneStopBit = 0U, /*!< One stop bit */
        kUSART_TwoStopBit = 1U, /*!< Two stop bits */
    } usart_stop_bit_count_t;

/*! @brief USART data size. */
    typedef enum _usart_data_len
    {
        kUSART_7BitsPerChar = 0U, /*!< Seven bit mode */
        kUSART_8BitsPerChar = 1U, /*!< Eight bit mode */
    } usart_data_len_t;

/*! @brief USART clock polarity configuration, used in sync mode.*/
    typedef enum _usart_clock_polarity
    {
        kUSART_RxSampleOnFallingEdge = 0x0U, /*!< Un_RXD is sampled on the falling edge of SCLK. */
        kUSART_RxSampleOnRisingEdge = 0x1U,  /*!< Un_RXD is sampled on the rising edge of SCLK. */
    } usart_clock_polarity_t;

/*! @brief txFIFO watermark values */
    typedef enum _usart_txfifo_watermark
    {
        kUSART_TxFifo0 = 0, /*!< USART tx watermark is empty */
        kUSART_TxFifo1 = 1, /*!< USART tx watermark at 1 item */
        kUSART_TxFifo2 = 2, /*!< USART tx watermark at 2 items */
        kUSART_TxFifo3 = 3, /*!< USART tx watermark at 3 items */
        kUSART_TxFifo4 = 4, /*!< USART tx watermark at 4 items */
        kUSART_TxFifo5 = 5, /*!< USART tx watermark at 5 items */
        kUSART_TxFifo6 = 6, /*!< USART tx watermark at 6 items */
        kUSART_TxFifo7 = 7, /*!< USART tx watermark at 7 items */
    } usart_txfifo_watermark_t;

/*! @brief rxFIFO watermark values */
    typedef enum _usart_rxfifo_watermark
    {
        kUSART_RxFifo1 = 0, /*!< USART rx watermark at 1 item */
        kUSART_RxFifo2 = 1, /*!< USART rx watermark at 2 items */
        kUSART_RxFifo3 = 2, /*!< USART rx watermark at 3 items */
        kUSART_RxFifo4 = 3, /*!< USART rx watermark at 4 items */
        kUSART_RxFifo5 = 4, /*!< USART rx watermark at 5 items */
        kUSART_RxFifo6 = 5, /*!< USART rx watermark at 6 items */
        kUSART_RxFifo7 = 6, /*!< USART rx watermark at 7 items */
        kUSART_RxFifo8 = 7, /*!< USART rx watermark at 8 items */
    } usart_rxfifo_watermark_t;

/*!
 * @brief USART interrupt configuration structure, default settings all disabled.
 */
    enum _usart_interrupt_enable
    {
        kUSART_TxErrorInterruptEnable = ( USART_FIFOINTENSET_TXERR_MASK ),
        kUSART_RxErrorInterruptEnable = ( USART_FIFOINTENSET_RXERR_MASK ),
        kUSART_TxLevelInterruptEnable = ( USART_FIFOINTENSET_TXLVL_MASK ),
        kUSART_RxLevelInterruptEnable = ( USART_FIFOINTENSET_RXLVL_MASK ),
    };

/*!
 * @brief USART status flags.
 *
 * This provides constants for the USART status flags for use in the USART functions.
 */
    enum _usart_flags
    {
        kUSART_TxError = ( USART_FIFOSTAT_TXERR_MASK ),                 /*!< TEERR bit, sets if TX buffer is error */
        kUSART_RxError = ( USART_FIFOSTAT_RXERR_MASK ),                 /*!< RXERR bit, sets if RX buffer is error */
        kUSART_TxFifoEmptyFlag = ( USART_FIFOSTAT_TXEMPTY_MASK ),       /*!< TXEMPTY bit, sets if TX buffer is empty */
        kUSART_TxFifoNotFullFlag = ( USART_FIFOSTAT_TXNOTFULL_MASK ),   /*!< TXNOTFULL bit, sets if TX buffer is not full */
        kUSART_RxFifoNotEmptyFlag = ( USART_FIFOSTAT_RXNOTEMPTY_MASK ), /*!< RXNOEMPTY bit, sets if RX buffer is not empty */
        kUSART_RxFifoFullFlag = ( USART_FIFOSTAT_RXFULL_MASK ),         /*!< RXFULL bit, sets if RX buffer is full */
    };

/*! @brief USART configuration structure. */
    typedef struct _usart_config
    {
        uint32_t baudRate_Bps;                /*!< USART baud rate  */
        usart_parity_mode_t parityMode;       /*!< Parity mode, disabled (default), even, odd */
        usart_stop_bit_count_t stopBitCount;  /*!< Number of stop bits, 1 stop bit (default) or 2 stop bits  */
        usart_data_len_t bitCountPerChar;     /*!< Data length - 7 bit, 8 bit  */
        bool loopback;                        /*!< Enable peripheral loopback */
        bool enableRx;                        /*!< Enable RX */
        bool enableTx;                        /*!< Enable TX */
        bool enableContinuousSCLK;            /*!< USART continuous Clock generation enable in synchronous master mode. */
        bool enableMode32k;                   /*!< USART uses 32 kHz clock from the RTC oscillator as the clock source. */
        bool enableHardwareFlowControl;       /*!< Enable hardware control RTS/CTS */
        usart_txfifo_watermark_t txWatermark; /*!< txFIFO watermark */
        usart_rxfifo_watermark_t rxWatermark; /*!< rxFIFO watermark */
        usart_sync_mode_t syncMode;           /*!< Transfer mode select - asynchronous, synchronous master, synchronous slave. */
        usart_clock_polarity_t clockPolarity; /*!< Selects the clock polarity and sampling edge in synchronous mode. */
    } usart_config_t;

/*! @brief USART transfer structure. */
    typedef struct _usart_transfer
    {
        /*
         * Use separate TX and RX data pointer, because TX data is const data.
         * The member data is kept for backward compatibility.
         */
        union
        {
            uint8_t * data;         /*!< The buffer of data to be transfer.*/
            uint8_t * rxData;       /*!< The buffer to receive data. */
            const uint8_t * txData; /*!< The buffer of data to be sent. */
        };
        size_t dataSize;            /*!< The byte count to be transfer. */
    } usart_transfer_t;

